[
  {
    "step": 1,
    "type": "map",
    "title": "The World of James 1:2-18",
    "description": "James, a bondservant of God and of the Lord Jesus Christ, wrote to the twelve tribes scattered abroad (in the Dispersion). James was Jesus' half-brother who became leader of the Jerusalem church. He wrote to Jewish believers dispersed throughout the Roman world, many facing trials, testing, and temptation.",
    "mapData": {
      "center": [35.5, 35.0],
      "zoom": 5,
      "layers": [
        {
          "name": "Roman Empire",
          "url": "https://www.openhistoricalmap.org/map-styles/main/main.json",
          "attribution": "© OpenHistoricalMap contributors"
        }
      ],
      "markers": [
        {
          "lat": 31.7683,
          "lng": 35.2137,
          "label": "Jerusalem - James the Just",
          "description": "Where James, a bondservant of God and the Lord Jesus Christ, led the Jerusalem church. Known as 'James the Just,' he was martyred around 62 AD.",
          "type": "author",
          "icon": "fas fa-pen-fancy"
        },
        {
          "lat": 31.7780,
          "lng": 35.2354,
          "label": "Stephen's Martyrdom - Scattering Begins",
          "description": "Stephen's death (Acts 7-8) triggered great persecution in Jerusalem, causing believers to scatter throughout Judea, Samaria, and beyond (Acts 8:1)",
          "type": "persecution",
          "icon": "fas fa-skull-crossbones"
        },
        {
          "lat": 41.9028,
          "lng": 12.4964,
          "label": "Trials in Rome",
          "description": "Jewish believers in Rome faced suspicion from both Jewish synagogues and Roman authorities, experiencing social ostracism and economic hardship",
          "type": "trial",
          "icon": "fas fa-fire"
        },
        {
          "lat": 37.9795,
          "lng": 23.7162,
          "label": "Persecution in Greece",
          "description": "Scattered believers in Athens and Corinth faced trials from pagan neighbors and Jewish opposition (Acts 17-18)",
          "type": "trial",
          "icon": "fas fa-fire"
        },
        {
          "lat": 37.8746,
          "lng": 27.2658,
          "label": "Trials in Asia Minor",
          "description": "Jewish Christians in Ephesus and surrounding regions faced persecution from both synagogues and pagan merchants (Acts 19)",
          "type": "trial",
          "icon": "fas fa-fire"
        },
        {
          "lat": 36.2021,
          "lng": 36.1604,
          "label": "Poverty & Testing in Antioch",
          "description": "Diaspora believers in Antioch faced economic trials and famine, requiring relief from other churches (Acts 11:27-30)",
          "type": "trial",
          "icon": "fas fa-wheat-awn-slash"
        },
        {
          "lat": 31.2001,
          "lng": 29.9187,
          "label": "Hostility in Alexandria",
          "description": "Jewish believers in Egypt's largest city faced opposition from traditional Jewish communities and Greek-speaking pagans",
          "type": "trial",
          "icon": "fas fa-fire"
        },
        {
          "lat": 41.9973,
          "lng": 21.4280,
          "label": "Macedonia - Philippi & Thessalonica",
          "description": "Regions in northern Greece where Jewish Christian communities were established among the diaspora",
          "type": "audience",
          "icon": "fas fa-users"
        },
        {
          "lat": 37.9795,
          "lng": 23.7162,
          "label": "Achaia - Athens & Corinth",
          "description": "Southern Greece region with significant Jewish diaspora communities receiving James's letter",
          "type": "audience",
          "icon": "fas fa-users"
        },
        {
          "lat": 37.8746,
          "lng": 27.2658,
          "label": "Asia - Ephesus",
          "description": "Major province in western Asia Minor with large Jewish Christian populations in the Dispersion",
          "type": "audience",
          "icon": "fas fa-people-group"
        },
        {
          "lat": 38.6234,
          "lng": 34.7286,
          "label": "Galatia & Cappadocia",
          "description": "Central Asia Minor regions where Jewish believers were scattered (1 Peter 1:1)",
          "type": "audience",
          "icon": "fas fa-people-group"
        },
        {
          "lat": 40.1828,
          "lng": 29.0667,
          "label": "Bithynia & Pontus",
          "description": "Northern Asia Minor provinces along the Black Sea with diaspora Jewish communities",
          "type": "audience",
          "icon": "fas fa-people-group"
        },
        {
          "lat": 36.2021,
          "lng": 36.1604,
          "label": "Syria - Antioch",
          "description": "Major diaspora hub where Jewish believers scattered by persecution preached the gospel (Acts 11:19-26)",
          "type": "audience",
          "icon": "fas fa-users"
        },
        {
          "lat": 35.1264,
          "lng": 33.4299,
          "label": "Cyprus - Paphos",
          "description": "Island where Jewish believers from Cyprus fled and established communities (Acts 11:19-20)",
          "type": "audience",
          "icon": "fas fa-people-group"
        },
        {
          "lat": 35.1856,
          "lng": 25.1300,
          "label": "Crete",
          "description": "Mediterranean island with Jewish communities part of the broader Dispersion",
          "type": "audience",
          "icon": "fas fa-people-group"
        },
        {
          "lat": 31.2001,
          "lng": 29.9187,
          "label": "Egypt - Alexandria",
          "description": "Major center of Jewish diaspora with large communities of Hellenistic Jews",
          "type": "audience",
          "icon": "fas fa-users"
        },
        {
          "lat": 32.8872,
          "lng": 21.9011,
          "label": "Cyrene (Libya)",
          "description": "North African region with significant Jewish diaspora (Acts 11:20 mentions men from Cyrene)",
          "type": "audience",
          "icon": "fas fa-users"
        },
        {
          "lat": 41.9028,
          "lng": 12.4964,
          "label": "Rome - Italy",
          "description": "Imperial capital with large Jewish population, some believing in Jesus among the Dispersion",
          "type": "audience",
          "icon": "fas fa-landmark"
        }
      ],
      "arrows": [
        {
          "from": [31.7683, 35.2137],
          "to": [36.2021, 36.1604],
          "label": "Scattering to Antioch",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [35.1264, 33.4299],
          "label": "Scattering to Cyprus",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [37.8746, 27.2658],
          "label": "Scattering to Asia Minor",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [37.9795, 23.7162],
          "label": "Scattering to Greece",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [41.9973, 21.4280],
          "label": "Scattering to Macedonia",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [31.2001, 29.9187],
          "label": "Scattering to Egypt",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [32.8872, 21.9011],
          "label": "Scattering to Cyrene",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [41.9028, 12.4964],
          "label": "Scattering to Rome",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [40.1828, 29.0667],
          "label": "Scattering to Bithynia",
          "color": "#3b82f6"
        },
        {
          "from": [31.7683, 35.2137],
          "to": [35.1856, 25.1300],
          "label": "Scattering to Crete",
          "color": "#3b82f6"
        }
      ]
    }
  },
  {
    "step": 2,
    "type": "cluster",
    "title": "Structure of James 1:2-18",
    "description": "James 1:2-18 is carefully structured into five interconnected sections, each building on the previous to present a complete picture of how believers should respond to trials and understand God's character.",
    "clusterData": {
      "title": "Five Sections of James 1:2-18",
      "description": "Explore the interconnected themes by clicking on each section",
      "nodes": [
        {
          "id": "section-a",
          "label": "Joy in Trials",
          "section": "A",
          "verses": "v. 2-4",
          "description": "Count it all joy when you fall into various trials, knowing that the testing of your faith produces patience. Let patience have its perfect work, that you may be perfect and complete, lacking nothing.",
          "theme": "Joy in Trials → Perseverance & Maturity",
          "keywords": ["joy", "trials", "testing", "patience", "perseverance", "maturity", "complete"],
          "thoughtProvoking": [
            {
              "type": "observe",
              "text": "Notice James doesn't say 'if' trials come, but 'when' - as though difficulty is guaranteed in the Christian life."
            },
            {
              "type": "consider",
              "text": "Consider the paradox: counting it 'all joy' when facing trials. James isn't asking you to enjoy suffering, but to see beyond it."
            },
            {
              "type": "reflect",
              "text": "The goal isn't just endurance, but becoming 'perfect and complete, lacking nothing' - what might God be developing in you right now through difficulty?"
            },
            {
              "type": "consider",
              "text": "Think about how a goldsmith refines gold - the heat doesn't destroy it, it purifies it. How does this image change your view of trials?"
            },
            {
              "type": "question",
              "text": "James says trials 'test' your faith - not to prove it's fake, but to prove it's real. What's the difference?"
            }
          ]
        },
        {
          "id": "section-b",
          "label": "Ask for Wisdom",
          "section": "B",
          "verses": "v. 5-8",
          "description": "If any of you lacks wisdom, let him ask of God, who gives to all liberally and without reproach. But let him ask in faith, with no doubting, for he who doubts is like a wave of the sea driven and tossed by the wind.",
          "theme": "Ask for Wisdom → God Gives Generously",
          "keywords": ["wisdom", "ask", "faith", "doubt", "double-minded", "unstable", "God gives"],
          "thoughtProvoking": [
            "Notice the connection: when trials come, the first thing we need isn't strength or courage, but wisdom to see what God is doing.",
            "God gives 'liberally and without reproach' - He won't scold you for asking, or make you feel foolish for not knowing. Have you been hesitant to ask?",
            "Consider the image of a wave tossed by wind - unstable, going nowhere, exhausting itself. This is what doubt does to prayer.",
            "The double-minded person is literally 'two-souled' - trying to trust God and trust themselves at the same time. Where do you see this in your own heart?",
            "James promises wisdom will 'be given' - not earned, not deserved, but generously given. What does this tell you about God's character?"
          ]
        },
        {
          "id": "section-c",
          "label": "Humility & Perspective",
          "section": "C",
          "verses": "v. 9-11",
          "description": "Let the lowly brother glory in his exaltation, and the rich in his humiliation, because as a flower of the field he will pass away. For no sooner has the sun risen with a burning heat than it withers the grass.",
          "theme": "Humility & Perspective → Rich & Poor Contrasted",
          "keywords": ["poor", "rich", "exaltation", "humiliation", "temporary", "perspective", "glory"],
          "thoughtProvoking": [
            "Notice the reversal: the poor should boast in being lifted up, the rich in being brought low. Both find their worth outside their wallet.",
            "Consider the flower - beautiful one day, withered the next. James says this is the rich person 'in the midst of his pursuits.' What are you pursuing that won't last?",
            "The poor brother has 'exaltation' - not someday in heaven, but now. What riches do you already have in Christ that economic status can't touch?",
            "Think about it: if your bank account doesn't define the poor Christian, why would it define the wealthy one? What does define you?",
            "Both poverty and wealth are called temporary - like grass that withers. What remains when everything else fades?"
          ]
        },
        {
          "id": "section-d",
          "label": "Enduring Temptation",
          "section": "D",
          "verses": "v. 12-15",
          "description": "Blessed is the man who endures temptation; for when he has been approved, he will receive the crown of life. Let no one say when he is tempted, 'I am tempted by God'; for God cannot be tempted by evil, nor does He Himself tempt anyone.",
          "theme": "Temptation → Blessing for Those Who Persevere",
          "keywords": ["temptation", "endure", "crown of life", "desire", "sin", "death", "blessed"],
          "thoughtProvoking": [
            "Notice the crucial distinction: trials come from outside to strengthen you; temptation comes from inside to destroy you.",
            "James is emphatic: 'Let no one say when tempted, I am tempted by God.' Why is it so important that we don't blame God for our sin?",
            "Consider the progression James describes: desire → enticed → conceived → birth → death. It's like watching sin grow from seed to deadly fruit. Where can you stop it?",
            "The promise is clear: endure temptation and receive 'the crown of life.' But notice - the crown comes after enduring, not after giving in.",
            "Think about your own patterns: what desires typically entice you? What would change if you interrupted the cycle earlier?"
          ]
        },
        {
          "id": "section-e",
          "label": "God's Good Gifts",
          "section": "E",
          "verses": "v. 16-18",
          "description": "Every good gift and every perfect gift is from above, and comes down from the Father of lights, with whom there is no variation or shadow of turning. Of His own will He brought us forth by the word of truth, that we might be a kind of firstfruits of His creatures.",
          "theme": "God is the Source of Good → New Birth & Divine Purpose",
          "keywords": ["good gift", "perfect gift", "Father", "no variation", "word of truth", "new birth", "firstfruits"],
          "thoughtProvoking": [
            "Notice the contrast: verses 13-15 describe evil's source (our own desires); verses 16-18 describe good's source (God alone). Two very different origins.",
            "Consider what 'no variation or shadow of turning' means - God doesn't change His mind, doesn't have mood swings, doesn't alternate between good and evil. He is consistently, unchangingly good.",
            "The ultimate good gift isn't health, wealth, or even wisdom - it's being 'brought forth by the word of truth.' You were born again by God's choice, not your own effort.",
            "Think about being called 'firstfruits' - the first and best portion, set apart for God. What does this identity mean for how you face trials?",
            "Look back: trials test you (v.2-4), wisdom guides you (v.5-8), perspective steadies you (v.9-11), endurance crowns you (v.12-15), and God's character anchors everything (v.16-18). See how it all connects?"
          ]
        }
      ]
    },
    "content": [
      {
        "subtitle": "Section A: Joy in Trials (v. 2-4)",
        "text": "**'Count it all joy when you fall into various trials'**\n\nJames begins with a paradoxical command: find joy in trials. The key word is 'when' (not 'if') - trials are inevitable. These 'various trials' test the genuineness of our faith, producing perseverance (endurance). The goal is spiritual maturity - being 'perfect and complete, lacking nothing.' Trials aren't punishment but opportunities for growth.",
        "verses": "James 1:2-4",
        "theme": "Joy in Trials → Perseverance & Maturity"
      },
      {
        "subtitle": "Section B: Ask for Wisdom (v. 5-8)",
        "text": "**'If any of you lacks wisdom, let him ask of God'**\n\nWhen facing trials, we need divine wisdom to respond correctly. James promises that God 'gives to all liberally and without reproach' - generously and without criticism. However, we must 'ask in faith, with no doubting.' The double-minded person (wavering between faith and doubt) is 'unstable in all his ways' and receives nothing. Wisdom comes through unwavering trust in God's character.",
        "verses": "James 1:5-8",
        "theme": "Ask for Wisdom → God Gives Generously"
      },
      {
        "subtitle": "Section C: Humility & Perspective (v. 9-11)",
        "text": "**'Let the lowly brother glory in his exaltation, and the rich in his humiliation'**\n\nJames addresses both poor and wealthy believers with a radical perspective shift. The poor should 'glory' in their spiritual exaltation in Christ - they have riches that transcend economics. The rich should 'glory' in their humiliation - recognizing that earthly wealth is temporary, fading 'like a flower of the field.' This counters worldly values and reminds all believers that true worth is found in Christ alone.",
        "verses": "James 1:9-11",
        "theme": "Humility & Perspective → Rich & Poor Contrasted"
      },
      {
        "subtitle": "Section D: Temptation (v. 12-15)",
        "text": "**'Blessed is the man who endures temptation'**\n\nJames distinguishes between trials (external tests from circumstances) and temptations (internal enticements to sin). Those who endure receive 'the crown of life' - eternal reward. Crucially, God never tempts anyone to evil. Temptation arises from our own desires. James traces the progression: desire → enticement → conception → birth of sin → maturity → death. Understanding this pattern helps us interrupt it before sin takes root.",
        "verses": "James 1:12-15",
        "theme": "Temptation → Blessing for Those Who Persevere"
      },
      {
        "subtitle": "Section E: God is the Source of Good (v. 16-18)",
        "text": "**'Every good gift and every perfect gift is from above'**\n\nJames concludes by pointing to God's unchanging character. Unlike the source of temptation, God gives only good gifts. There is no variation or shadow in Him - He is perfectly consistent. The ultimate good gift is spiritual rebirth: 'He chose to give us birth through the word of truth, that we might be a kind of firstfruits of his creatures.' Our new birth is God's gracious work, securing our identity as His children and guaranteeing His ongoing goodness toward us.",
        "verses": "James 1:16-18",
        "theme": "God is the Source of Good → New Birth & Divine Purpose"
      },
      {
        "subtitle": "How the Sections Connect",
        "text": "These five sections form a logical progression:\n\n1. **Trials are opportunities** for spiritual growth (v. 2-4)\n2. **Wisdom is needed** to navigate trials rightly (v. 5-8)\n3. **Perspective matters** - eternal values trump earthly ones (v. 9-11)\n4. **Temptation must be resisted** - it leads to death, not life (v. 12-15)\n5. **God's character is trustworthy** - He gives only good gifts (v. 16-18)\n\nTogether, they teach believers how to face suffering: with joy, seeking wisdom, maintaining proper perspective, resisting temptation, and trusting in God's goodness."
      }
    ]
  }
]
